app/xml/brainsys-services/ConsultaStockRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bra="http://brainsys.com.ar/">
   <soapenv:Header/>
   <soapenv:Body>
      <bra:obtenerStock>
         <!--Optional:-->
         <bra:sesion>
            <!--Optional:-->
            <bra:usuario>
               <bra:usua_id>9</bra:usua_id>
               <!--Optional:-->
               <bra:usua_nombre>AgGalicia</bra:usua_nombre>
               <!--Optional:-->
               <bra:usua_clie_id>00000SP708</bra:usua_clie_id>
               <!--Optional:-->
               <bra:usua_estadoPorDefecto>DIS</bra:usua_estadoPorDefecto>
               <bra:usua_vencimientoPassword>0</bra:usua_vencimientoPassword>
               <bra:usua_ingreso>2014-11-18T00:00:00</bra:usua_ingreso>
               <!--Optional:-->
               <bra:usua_password>7C4A8D09CA3762AF61E59520943DC26494F8941B</bra:usua_password>
               <bra:usua_altaPassword>2019-03-26T00:00:00</bra:usua_altaPassword>
            </bra:usuario>
            <bra:fecha>2019-06-12T00:00:00-03:00</bra:fecha>
         </bra:sesion>
         <!--Optional:-->
         <bra:filtro>
            <bra:fechaDesde></bra:fechaDesde>
            <bra:fechaHasta></bra:fechaHasta>
            <bra:compania></bra:compania>
            <bra:producto></bra:producto>
            <bra:lote></bra:lote>
         </bra:filtro>
      </bra:obtenerStock>
   </soapenv:Body>
</soapenv:Envelope>